reddit_clone/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("session_token", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save